InformationRegisters/DeleteAccessValuesSets.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>DeleteAccessValuesSets</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Read</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Insert</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Update</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Delete</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>AccessKindWithoutAccessValueGroups</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccessKindUniqueForAccessValueType</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccessKindThroughRightsByAccessValues</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccessKindReadingRight</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.DeleteAccessKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccessKindAddingRight</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.DeleteAccessKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccessKindChangingRight</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.DeleteAccessKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ObjectType</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccessValueType</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Object</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>NumberOfSet</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AccessKind</Name>
					<Comment>Blank values must be allowed to avoid errors on writing objects that are being checked</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.DeleteAccessKinds</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AccessValue</Name>
					<Comment>Blank values must be allowed to avoid errors on writing objects that are being checked</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/AccessValuesSets.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>AccessValuesSets</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Read</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Update</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>StandardValue</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ValueWithoutGroups</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Object</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>NumberOfSet</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AccessValue</Name>
					<Comment>Blank values must be allowed to avoid errors on writing objects that are being checked</Comment>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Adjustment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/AdditionalAccessValues.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>AdditionalAccessValues</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AccessPermitted</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AccessDenied</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/MetadataObjectIDs.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>MetadataObjectIDs</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>CollectionOrder</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Name</Name>
					<Comment>For example, "TaskAddressingObjects"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Synonym</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FullName</Name>
					<Comment>For example, "ChartOfCharacteristicTypes.TaskAddressingObjects"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FullSynonym</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WithoutData</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmptyRefValue</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MetadataObjectKey</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NewRef</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/DeleteAccessValuesSets/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ServiceProgramInterface

// Handler of the infobase update.
Function MoveDataToNewTable() Export
	
	DataAvailabilityQuery = New Query;
	DataAvailabilityQuery.Text =
	"SELECT TOP 1
	|	TRUE AS TrueValue
	|FROM
	|	InformationRegister.DeleteAccessValuesSets AS DeleteAccessValuesSets";
	
	If DataAvailabilityQuery.Execute().IsEmpty() Then
		Return True;
	EndIf;
	
	If Not AccessManagement.LimitAccessOnRecordsLevel() Then
		RecordSet = InformationRegisters.DeleteAccessValuesSets.CreateRecordSet();
		RecordSet.Write();
	EndIf;
	
	ObjectsTypes = AccessManagementServiceReUse.TypesOfObjectsInSubscriptionsToEvents(
		"RecordSetsOfAccessValues", True);
	
	Query = New Query;
	Query.Parameters.Insert("ObjectsTypes", ObjectsTypes);
	Query.Text =
	"SELECT DISTINCT TOP 10000
	|	DeleteAccessValuesSets.Object
	|FROM
	|	InformationRegister.DeleteAccessValuesSets AS DeleteAccessValuesSets
	|		INNER JOIN Catalog.MetadataObjectIDs AS IDs
	|		ON (VALUETYPE(DeleteAccessValuesSets.Object) = VALUETYPE(IDs.EmptyRefValue))
	|			AND (IDs.EmptyRefValue IN (&ObjectsTypes))";
	
	Selection = Query.Execute().Select();
	OldRecordSet = InformationRegisters.DeleteAccessValuesSets.CreateRecordSet();
	NewRecordSet = InformationRegisters.AccessValuesSets.CreateRecordSet();
	
	CheckQuery = New Query;
	CheckQuery.Text =
	"SELECT TOP 1
	|	TRUE AS TrueValue
	|FROM
	|	InformationRegister.AccessValuesSets AS AccessValuesSets
	|WHERE
	|	AccessValuesSets.Object = &Object";
	
	While Selection.Next() Do
		OldRecordSet.Filter.Object.Set(Selection.Object);
		NewRecordSet.Filter.Object.Set(Selection.Object);
		CheckQuery.SetParameter("Object", Selection.Object);
		NewRecordSet.Clear();
		NewSets = AccessManagement.TableAccessValueSets();
		
		ObjectMetadata = Selection.Object.Metadata();
		ObjectWithSets = ObjectMetadata.TabularSections.Find("AccessValuesSets") <> Undefined;
		
		Block = New DataLock;
		LockItem = Block.Add("InformationRegister.AccessValuesSets");
		LockItem.Mode = DataLockMode.Exclusive;
		LockItem.SetValue("Object", Selection.Object);
		If ObjectWithSets Then
			LockItem = Block.Add(ObjectMetadata.FullName());
			LockItem.Mode = DataLockMode.Exclusive;
			LockItem.SetValue("Ref", Selection.Object);
		EndIf;
		
		BeginTransaction();
		Try
			Block.Lock();
			If CheckQuery.Execute().IsEmpty() Then
				OldRecordSet.Read();
				AdjustmentFilled = False;
				FillNewObjectSets(OldRecordSet, NewSets, AdjustmentFilled);
				If AdjustmentFilled AND ObjectWithSets Then
					Object = Selection.Object.GetObject();
					Object.AccessValuesSets.Load(NewSets);
					InfobaseUpdate.WriteData(Object);
				EndIf;
				AccessManagementService.PrepareAccessToRecordsValuesSets(
					Selection.Object, NewSets, True);
				NewRecordSet.Load(NewSets);
				NewRecordSet.Write();
			EndIf;
			OldRecordSet.Clear();
			OldRecordSet.Write();
			CommitTransaction();
		Except
			RollbackTransaction();
			Raise;
		EndTry;
	EndDo;
	
	If Selection.Count() < 10000 Then
		
		If Not DataAvailabilityQuery.Execute().IsEmpty() Then
			RecordSet = InformationRegisters.DeleteAccessValuesSets.CreateRecordSet();
			RecordSet.Write();
		EndIf;
		
		WriteLogEvent(
			NStr("en = 'Acces management. Filling data for access restriction'",
				 CommonUseClientServer.MainLanguageCode()),
			EventLogLevel.Information,
			,
			,
			NStr("en = 'The data transfer from the DeleteAccessValuesSets register is complete.'"),
			EventLogEntryTransactionMode.Transactional);
	Else
		WriteLogEvent(
			NStr("en = 'Acces management. Filling data for access restriction'",
				 CommonUseClientServer.MainLanguageCode()),
			EventLogLevel.Information,
			,
			,
			NStr("en = 'The step of the data transfer from the DeleteAccessValuesSets register is executed.'"),
			EventLogEntryTransactionMode.Transactional);
	EndIf;
	
	Return False;
	
EndFunction

Procedure FillNewObjectSets(OldRecords, NewSets, AdjustmentFilled)
	
	ValidSets = New Map;
	
	For Each OldRow IN OldRecords Do
		If OldRow.Read Or OldRow.Update Then
			ValidSets.Insert(OldRow.NumberOfSet, True);
		EndIf;
	EndDo;
	
	RightSettingsOwnerTypes = AccessManagementServiceReUse.Parameters(
		).PossibleRightsForObjectRightsSettings.ByRefsTypes;
	
	For Each OldRow IN OldRecords Do
		If ValidSets.Get(OldRow.NumberOfSet) = Undefined Then
			Continue;
		EndIf;
		NewRow = NewSets.Add();
		FillPropertyValues(NewRow, OldRow, "SetNumber, AccessValue, Reading, Change");
		
		If OldRow.AccessKind = ChartsOfCharacteristicTypes.DeleteAccessKinds.EmptyRef() Then
			If OldRow.AccessValue = Undefined Then
				NewRow.AccessValue = Enums.AdditionalAccessValues.AccessDenied;
			Else
				NewRow.AccessValue = Enums.AdditionalAccessValues.AccessPermitted;
			EndIf;
		
		ElsIf OldRow.AccessKind = ChartsOfCharacteristicTypes.DeleteAccessKinds.ReadRight
		      OR OldRow.AccessKind = ChartsOfCharacteristicTypes.DeleteAccessKinds.EditRight
		      OR OldRow.AccessKind = ChartsOfCharacteristicTypes.DeleteAccessKinds.AddRight Then
			
			If TypeOf(OldRow.AccessValue) <> Type("CatalogRef.MetadataObjectIDs") Then
				If Metadata.FindByType(TypeOf(OldRow.AccessValue)) = Undefined Then
					NewRow.AccessValue = Catalogs.MetadataObjectIDs.EmptyRef();
				Else
					NewRow.AccessValue =
						CommonUse.MetadataObjectID(TypeOf(OldRow.AccessValue));
				EndIf;
			EndIf;
			
			If OldRow.AccessKind = ChartsOfCharacteristicTypes.DeleteAccessKinds.ReadRight Then
				NewRow.Adjustment = Catalogs.MetadataObjectIDs.EmptyRef();
			Else
				NewRow.Adjustment = NewRow.AccessValue;
			EndIf;
			
		ElsIf RightSettingsOwnerTypes.Get(TypeOf(OldRow.AccessValue)) <> Undefined Then
			
			NewRow.Adjustment = CommonUse.MetadataObjectID(TypeOf(OldRow.Object));
		EndIf;
		
		If ValueIsFilled(NewRow.Adjustment) Then
			AdjustmentFilled = True;
		EndIf;
	EndDo;
	
	AccessManagement.AddAccessValueSets(
		NewSets, AccessManagement.TableAccessValueSets(), False, True);
	
EndProcedure

#EndRegion

#EndIf
